---
kind: property
id: P:Autodesk.Revit.DB.Visual.MasonryCMU.MasonryCMUType
source: html/36205ced-6a34-b1ec-cfbf-72e357963418.htm
---
# Autodesk.Revit.DB.Visual.MasonryCMU.MasonryCMUType Property

The property labeled "Type" from the "MasonryCMU" schema.

## Syntax (C#)
```csharp
public static string MasonryCMUType { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MasonryCMUType".